{"data":{"markdownRemark":{"html":"<h4>Homework Review</h4>\n<p>homework was to create wireframes </p>\n<ol>\n<li>\n<p>what did you learn  </p>\n<ul>\n<li>easy to over complicate</li>\n<li>important to iterate</li>\n<li>think about WHO is actually using your product</li>\n</ul>\n</li>\n<li>what surprised you?</li>\n<li>what would you do differently</li>\n<li>wuestions about ux?  </li>\n</ol>\n<p>there are image scanners in use in japan re checkout</p>\n<h2>Intro to Prototyping</h2>\n<p>a simulation or sample of the final product\ncommon steps: </p>\n<ol>\n<li>sketches: brainstorming</li>\n<li>wireframe: communication (content, layout)</li>\n<li>mock up: communication (visual design)</li>\n<li>\n<p>protoype: (simulation, interaction experience)</p>\n<ul>\n<li>think how do you wnat people to feel</li>\n<li>if things take longer what are you trying to achieve?      </li>\n</ul>\n</li>\n</ol>\n<p>Low-fidelity -- POP app</p>\n<h2>WHY make a prototype?</h2>\n<p>to test your hypothesis, and to help people understand your solution and the problem-- like a demonstration for stakeholders\naccessibility testing-- super important, to communicate the problem to people who dont know--\nall design to engage and drive empathy</p>\n<p>Prototype CRITICAL FLOWS FIRST--- only what you need--\nthink WHAT DO YOU WANT TO LEARN-- don't do it all!!!\nthink CORE INTERACTION</p>\n<p>set expectations for the testers-- hey this is a prototype, not everything works-- just the core interactions</p>\n<ul>\n<li>Review your problem statements</li>\n<li>How can you validate with your prototype  </li>\n</ul>\n<p><strong>OMG these paper protypes are amazing....</strong>  </p>\n<ul>\n<li>you can use <strong>Invision</strong>(you can import images and then add hotspots to simulate interaction, its super easy), <strong>POP app</strong> (for phone), <strong>UXPin</strong> (instructor uses this one a lot), <strong>Axure</strong> (is great for forms-- it can handle complex logic, but its cumbersome... its one of the biggest enterprise tools... but its a little slow) </li>\n<li>HTML/CSS -- could i create a protype with gatsby and material UI? <strong>FramerJS</strong></li>\n<li>Powerpoint / Keynote &#x3C;-- you can do quite a bit with this  </li>\n<li>Physical space - styroforam, cardboard<br>\nAdobe XD offers weekly challenges</li>\n</ul>\n<h3>Part of your homework will be to do a protoype and then usability test with a friend</h3>\n<blockquote>\n<p><em>if you want a great product you must test!</em>  </p>\n</blockquote>\n<h3>Test Plan</h3>\n<blockquote>\n<p>goals of the test<br>\nresearch questions<br>\ncharacteristics of your participants\ndescription of methodology<br>\nlist of tasks  </p>\n</blockquote>\n<pre><code>* think about what you want people to accomplish  \n* a single user research session typically takes about 30 minutes  \n</code></pre>\n<blockquote>\n<p>moderator script<br>\npost-test questionare\ndo a run through (pilot test)--> make sure there are no testing glitches</p>\n</blockquote>\n<p>give testers a context--<br>\nexample: you're at this parking meter for the first time-- what catches your attention, walk me through the steps and talk outloud, if their face changes ask them questions</p>\n<p><strong>conducting the test</strong><br>\nestablish rapport<br>\ntry super hard not to lead the tester -- no that screen was super hard huh, think: got it, versus good... try to keep acknowledgment neutral<br>\navoid extraneous body language or jargon<br>\noften good to time people<br>\nrecord people!<br>\nthen create a highlight reel<br>\nafter reviewing reserach, instructor will do affinity mapping (post-its) with team members  </p>\n<h3>GOALS and QUESTIONS</h3>\n<ol>\n<li>How might we make the search easier and less frustrating</li>\n<li>How can we utilise the loyalty program to incentivize and streamline</li>\n<li></li>\n</ol>\n<p>sooo</p>\n<h4>2-3 Goals</h4>\n<p>how can we make the non-barcode checkout system...<br>\neasier<br>\nfaster<br>\nand more personal  </p>\n<h4>2-3 tasks</h4>\n<ul>\n<li>you're buying an apple with out a barcode\nyou're not sure exactly what the apple is called</li>\n<li>you're buying broccoli, you know exactly what it is</li>\n<li>you're on your phone, and rushed for a meeting, buying bananas</li>\n<li>you're buying something you've bought many times before</li>\n<li>you're buying a large watermelon, its too large place on the scale</li>\n</ul>\n<p>in your presentation-- what did you learn, what would you do next\nthink about what was the flow-- how did you think about it, what is the story of my design, what choices did i make and why<br>\nthink 5 slides<br>\nplus then a demonstration of your prototype</p>","frontmatter":{"date":"November 29, 2018","path":"/blog/notes-prototyping","title":"Notes from my UX class, day 4: prototyping"}}},"pageContext":{}}