{"data":{"markdownRemark":{"html":"<h2>Who Buys Produce?</h2>\n<ul>\n<li><del>Chefs</del>  </li>\n<li>\n<p>People who plan cook at home or make their own food in some capacity</p>\n<ul>\n<li>\n<p>People who have food traditions that use more vegetables</p>\n<ul>\n<li>Vegetarians or people with special diets?</li>\n<li>Immigrants/people who don't follow traditional american diet</li>\n</ul>\n</li>\n<li>People who have time to cook</li>\n<li>People who want to save money</li>\n<li>People who want to be \"healthy\"</li>\n<li>People who dont typically cook but are making a special meal</li>\n<li>\n<p>People who typically buy a few common fruits and vegetables</p>\n<hr>\n</li>\n</ul>\n</li>\n</ul>\n<hr>\n<h2>Grab and Go</h2>\n<h4>My story</h4>\n<p>I live on my own and often only buy a few items when I go to the store.  I'm busy, and work a few different jobs, so I make it to the store when I can.  I'm usually just picking up a quick meal or snack on my way somewhere. Even though I dont have a lot of time, I want to eat healthy and often grab a couple easy to eat vegetables and fruit.</p>\n<h4>My Needs</h4>\n<ul>\n<li>I need it to be fast</li>\n<li>I need to find common fruits and vegetables quickly</li>\n<li>\n<p>Often I have my backpack with me, it'd be nice to be able to put items into it directly or set it somewhere</p>\n<h4>Basket or Cart</h4>\n<p>Always basket</p>\n<h4>Card or Cash</h4>\n<p>both, usually card</p>\n</li>\n</ul>\n<h4>Goals</h4>\n<p>Quick healthy meals and snacks, that dont require a lot of prep and that are relatively inexpensive</p>\n<h4>Purchases</h4>\n<ul>\n<li>bananas</li>\n<li>tomatoes</li>\n<li>apple</li>\n<li>orange</li>\n<li>celery</li>\n<li>carrots</li>\n</ul>\n<h4>Pain Points</h4>\n<ul>\n<li>having my bag with me</li>\n<li></li>\n</ul>\n<hr>\n<h2>Special Diet</h2>\n<h4>My story</h4>\n<p>I've been living with multiple food allergies for most of my life.  Because I have such a restricted diet its important for me to know whats in my food and so I do alot of my own cooking.  I often prepare my meals ahead on day I'm not working so its easier for me during the week.  I keep many shelf stable items at home, so when I'm going to the store its usually for fresh ingredients I cant keep on hand.  I still often choose the self check out because the lines are shorter, especially on the weekends when I tend to do most of my meal prep. </p>\n<h4>My Needs</h4>\n<ul>\n<li>I want it to be easy to find produce codes</li>\n<li>I want it to be easy to manage many groceries in the staging and bagging area</li>\n</ul>\n<h4>Basket or Cart</h4>\n<p>It depends/either</p>\n<h4>Card or Cash</h4>\n<p>Card</p>\n<h4>My Goals</h4>\n<p>Making meals I know are safe for me to eat.  Getting lots of ingredients at once to prepare multiple meals. </p>\n<h4>Pain Points</h4>\n<ul>\n<li>overly sensitive scale can be hard to manage with multiple items</li>\n<li>finding many produce items quickly</li>\n</ul>\n<hr>\n<h2>Date Night</h2>\n<p>I'm a working professional and often just go out to eat.  But every once in a while I want to prepare a special meal for friends or a date.  I usually have a meal or recipe in mind and head to the store after work to get the ingredients I need.  I dont have a lot of time, and I'm just buying enough for one meal so I usually just choose the shortest line.  Sometimes I'm getting unique or specialty produce items because I want my meal to feel special. I'm usually picking up a bottle of wine or something to drink as well.  </p>\n<h4>My Needs</h4>\n<ul>\n<li>I want it to be fast</li>\n<li>I dont want to feel stressed before my big night</li>\n<li>I want to think about my plans</li>\n<li>\n<p>I need to be able to look up unusual produce items</p>\n<h4>Basket or Cart</h4>\n<p>Basket</p>\n<h4>Card or Cash</h4>\n<p>Card</p>\n<h4>My Goals</h4>\n<p>To prepare a special occasion meal for someone I care about.</p>\n<h4>Pain Points</h4>\n</li>\n<li>finding unusual produce items</li>\n<li>buying alcohol</li>\n</ul>\n<hr>\n<h2>Busy Parent/ Caregiver</h2>\n<p>When I go to the store I usually have one of my kids with me in the cart or walking along side.  They are often distracted or bored so I try to give them something to do while we shop -- like carrying a basket or pushing a mini-cart.  <del>I dont always choose self checkout because it can be a lot to manage, but if I think it will save me time, I'll use it.</del>  I want to prepare healthy meals for my family and often buy easy to prepare produce like carrots and apples to put in lunches or ingredients to make sandwiches. I almost never use self checkout because it can be a nightmare with my kids, but when it looks like it will be faster I'll use it.</p>\n<h4>My Needs</h4>\n<ul>\n<li>Trying to manage kids and check out is hard, I need to be able to see clearly what I've bought and whats going on, because I'm often distracted, and my attention is coming and going from the screen and what I'm doing</li>\n<li>I don't have time to make complicated decisions, I want the screen to be simple and easy to understand</li>\n<li>I want it to be fast, waiting with young kids is hard</li>\n<li>\n<p>I'm already stressed at the store, I don't want to have to think too hard while I'm checking out or recieve a million error messages for problems I dont understand</p>\n<h4>My Goals</h4>\n<p>I want to get my food with minimal hassle while being able to keep my kids nearby.</p>\n<h4>Pain Points</h4>\n</li>\n<li>when my kids mess with items on the scale</li>\n<li>kids re-scanning things</li>\n<li>getting disctracted and not knowing whats happening with the machine -- why is it beeping?!</li>\n</ul>\n<hr>\n<h2>Busy Parent/ Caregiver</h2>\n<p>I moved here years ago with my partner before we had kids. Even though I've lived here for a long time now, I often prepare the food I grew up with. I want to prepare healthy meals for my family, we eat lot of produce. Sometimes the items I want are hard to find, but I've figured out what my local store carries and know were to look for it.  I like self checkout because I'm still </p>\n<h4>My Needs</h4>\n<ul>\n<li>Trying to manage kids and check out is hard, I need to be able to see clearly what I've bought and whats going on, because I'm often distracted, and my attention is coming and going from the screen and what I'm doing</li>\n<li>I don't have time to make complicated decisions, I want the screen to be simple and easy to understand</li>\n<li>I want it to be fast, waiting with young kids is hard</li>\n<li>\n<p>I'm already stressed at the store, I don't want to have to think too hard while I'm checking out or recieve a million error messages for problems I dont understand</p>\n<h4>My Goals</h4>\n<p>I want to get my food with minimal hassle while being able to keep my kids nearby.</p>\n<h4>Pain Points</h4>\n</li>\n<li>when my kids mess with items on the scale</li>\n<li>kids re-scanning things</li>\n<li>\n<p>getting disctracted and not knowing whats happening with the machine -- why is it beeping?!</p>\n<hr>\n</li>\n</ul>\n<h2>Stay at Home-Parent</h2>\n<p>When I go to the store its usually after I've dropped the kids off somewhere.  I try to go to the store mid week when I know it wont be as busy.  My family tries to eat healthy, so I'm usually buying fruits and vegetables that can go into snacks or meals, among other things I need for the next few days.</p>\n<h2>Work at Home</h2>\n<p>I live </p>\n<hr>\n<h2>Young Professional/Student</h2>\n<p>I like to try to make a lot of my own food because its cheaper </p>","frontmatter":{"date":"November 15, 2018","path":"/blog/notes-user-stories-hwk","title":"Homework from my UX class, user stories"}}},"pageContext":{}}