{"data":{"markdownRemark":{"html":"<h3>Day 3</h3>\n<h4>User Stories</h4>\n<ul>\n<li>user stories should be based on real people/ actual interviews</li>\n</ul>\n<h4>Classmate ideas</h4>\n<ul>\n<li>scanning for produce with codes</li>\n<li>bring bags y/n</li>\n<li>loyalty card y/n</li>\n<li>tagline or quote</li>\n<li>occupation/age/name?</li>\n<li>titles embodied personality /sticky names</li>\n<li>stories--almost like snap shots of a moment</li>\n<li>\n<p>behaviors rather than demographics</p>\n<ul>\n<li>\n<p>keep details related to behavior</p>\n<h3>Ideation Excersises:</h3>\n<h4>Problem Statement</h4>\n<p>related to the problem you're trying to solve with your design ex: bagging is confusing and makes people feel anxious</p>\n</li>\n</ul>\n</li>\n</ul>\n<p>what is the problem -- why is it a problem</p>\n<ul>\n<li>\n<p>it is difficult to look up items without a barcode</p>\n</li>\n<li>\n<p>looking up items with out a barcode is confusing and makes people feel frustrated</p>\n</li>\n<li>\n<p>looking up items with out a barcode takes a long time and is often confusng -- people feel frustrated and may give up, leave things behind or worry they are being charged for the wrong item</p>\n</li>\n<li>\n<p>looking up produce with out a barcode takes a long time with many confusing points and ambiguities -- not knowing the name or not finding the item -- people feel frustrated and may give up or purposefully choose the wrong item to speed up the process.  Even commonly purchased items can be difficult to find with out a barcode</p>\n</li>\n</ul>\n<h4>Insight Statements</h4>\n<p>I noticed <strong><strong>__</strong></strong>.  I think that means <strong><strong><strong>____</strong></strong></strong>.</p>\n<ul>\n<li>I noticed <strong>___</strong> with one item on the scale for a long time. I think that means they were having a hard time entering it in.</li>\n<li>I noticed <strong><strong>_</strong></strong> put an item in their bag with out paying for it after moving it around on the scale alot and clicking through screens, I think that means they were trying to enter it but couldn't figure out how.</li>\n<li>I noticed <strong>_</strong> enter in the wrong item after searching alphabetically and not finding their item.  </li>\n<li>I noticed <strong>__</strong> look at the screen and look around, then back at the screen.  I think they were confused</li>\n<li>I noticed <strong>__</strong> pick up an item set it on the scale and wait, click some screens, then do it again, look around, click some more and put the item in the bag.  the scale didn't check out but they waited it out.  I think they felt like they were spending too much time and wanted to be done</li>\n</ul>\n<h4>How Might We...</h4>\n<p>ex: Create a bagging experience that is sos inturitive it makes everyone feel like a grocery pro?</p>\n<ul>\n<li>create a produce or no barcode navigation system that makes people feel like the system is trying to help them?</li>\n<li>create a no-barcode system that is faster and more accurate than the check out clerk</li>\n<li>create a no-barcode system that rewards frequent shoppers by making commonly purchased items easy to access</li>\n<li>create a no-barcode navigation system that is simple enough to be easy to use for beginniners but extensive enough for people buying unique or seasonal items</li>\n<li>create a no-barcode system that makes it fast to find items without knowing the name or number, while also being specific enough to include all possible items</li>\n<li>create a no-barcode navigation system that is as easy as scanning a code </li>\n</ul>\n<h4>Brainstorm solutions</h4>\n<p>We wrote some of the things we came up with in the \"How Might We..\" section on stickys and organized them on the white board... then we wrote possible solutions on sticky notes around some of the 'how might we' propositions.</p>\n<p><img src=\"../images/user_problems_3.JPG\" alt=\"us looking at our sticky notes\" title=\"User problem sticky\">\n<em>here we are looking at our notes</em>  </p>\n<p><img src=\"../images/user_problems_1.JPG\" alt=\"sticky notes user problems\" title=\"User problem sticky\">\n<img src=\"../images/user_problems_2.JPG\" alt=\"sticky notes user problems\" title=\"User problem sticky\"></p>\n<h4>Story board solution</h4>\n<p><img src=\"../images/user_flow.JPG\" alt=\"sticky notes user flow\" title=\"User flow diagram\">\nOnce we'd come up with some proposed solutions we all returned to our seats to storyboard out some of/one of our proposed solutions-- what would that look like for the user? What is the first, second, third step etc</p>\n<h4>Sketches and wireframes</h4>\n<ul>\n<li>visual representation of functional requirements </li>\n<li>limited use of color and graphics </li>\n<li>sample text or lorem ipsom</li>\n<li>they allow you to test a flow or process without the user getting caught up on details</li>\n<li>good to look unfinished that way testers focus on the steps</li>\n</ul>\n<h4>HOMEWORK DUE WEEK 4:</h4>\n<p>Homework is to create a wireframe of one of the solutions\nMy plan was to design the screens that the user would be seeing-- but now I'm thinking I need to design some of the experience as well, if we use the image recognition one-- how exactly will that work, at what point will the machine prompt with image recognition? will the screen get too cluttered?</p>\n<ul>\n<li>\n<p>I've taken some photos of current self checkout screens</p>\n</li>\n<li>\n<p>TODO: use gatsby to create a page that just displays all the images in the UX_class folder-- and transforms them into thumbnails</p>\n</li>\n</ul>","frontmatter":{"date":"November 15, 2018","path":"/blog/notes-ideation","title":"Notes from my UX class, day 3: ideation"}}},"pageContext":{}}